//
//  ViewController.swift
//  flagKitExample
//
//  Created by 김대헌 on 2022/11/04.
//

import UIKit
import FlagKit

class ViewController: UITableViewController {
    override func viewDidLoad() {
        super.viewDidLoad()
    }

    override func tableView(_ tableView: UITableView, cellForRowAt indexPath: IndexPath) -> UITableViewCell {
        let cell = tableView.dequeueReusableCell(withIdentifier: "Cell") as! Cell
        
        cell.selectionStyle = .none
        cell.countryName.text = countryName[indexPath.row]
        cell.countryFlag.image = Flag(countryCode: countryCode[indexPath.row])?.image(style: .roundedRect)
        
        return cell
    }
    
    override func tableView(_ tableView: UITableView, numberOfRowsInSection section: Int) -> Int {
        return countryName.count
    }
    
    let countryName = ["안도라", "아랍에미리트", "아프가니스탄", "앤티가바부다", "앵귈라", "알바니아", "아르메니아", "앙골라", "아르헨티나", "미국령 사모아", "오스트리아", "호주", "아루바", "올란드 제도", "아제르바이잔", "보스니아 헤르체고비나", "바베이도스", "방글라데시", "벨기에", "부키나파소", "불가리아", "바레인", "부룬디", "베냉", "생바르텔레미", "버뮤다", "브루나이", "볼리비아", "브라질", "바하마", "부탄", "부베 섬", "보츠와나", "벨라루스", "벨리즈", "캐나다", "코코스 제도", "콩고 - 킨샤사", "중앙 아프리카 공화국", "콩고 - 브라자빌", "스위스", "코트디부아르", "쿡 제도", "칠레", "카메룬", "중국", "콜롬비아", "코스타리카", "쿠바", "카보베르데", "퀴라소", "크리스마스 섬", "키프로스", "체코", "독일", "지부티", "덴마크", "도미니카", "도미니카 공화국", "알제리", "에콰도르", "에스토니아", "이집트", "에리트레아", "스페인", "에티오피아", "유럽 ​​연합", "핀란드", "피지", "포클랜드 제도", "미크로네시아", "페로 제도", "프랑스", "가봉", "영국", "잉글랜드", "북아일랜드", "스코틀랜드", "웨일즈", "셰틀랜드 제도", "그레나다", "조지아", "프랑스령 기아나", "건지", "가나", "지브롤터", "그린란드", "감비아", "기니", "과들루프", "적도 기니", "그리스", "사우스 조지아 섬, 샌드위치 섬", "과테말라", "괌", "기니비사우", "가이아나", "홍콩", "허드 & 맥도날드 제도", "온두라스", "크로아티아", "아이티", "헝가리", "인도네시아", "아일랜드", "이스라엘", "맨 섬", "인도", "영국령 인도양 지역", "이라크", "이란", "아이슬란드", "이탈리아", "저지", "자메이카", "요르단", "일본", "케냐", "키르기스스탄", "캄보디아", "키리바시", "코모로", "세인트키츠네비스", "북한", "대한민국", "쿠웨이트", "케이맨 제도", "카자흐스탄", "라오스", "레바논", "세인트루시아", "LGBT", "리히텐슈타인", "스리랑카", "라이베리아", "레소토", "리투아니아", "룩셈부르크", "라트비아", "리비아", "모로코", "모나코", "몰도바", "몬테네그로", "세인트 마틴", "마다가스카르", "마셜 제도", "북마케도니아", "말리", "미얀마)", "몽골", "마카오", "북마리아나 제도", "마르티니크", "모리타니", "몬트세렛", "몰타", "모리셔스", "몰디브", "말라위", "멕시코", "말레이시아", "모잠비크", "나미비아", "뉴 칼레도니아", "니제르", "노퍽 섬", "나이지리아", "니카라과", "네덜란드", "노르웨이", "네팔", "나우루", "니우에", "뉴질랜드", "오만", "파나마", "페루", "프랑스령 폴리네시아", "파푸아 뉴기니", "필리핀 제도", "파키스탄", "폴란드", "생피에르 미클롱", "핏케언 제도", "푸에르토리코", "팔레스타인", "포르투갈", "팔라우", "파라과이", "카타르", "레위니옹", "루마니아", "세르비아", "러시아", "르완다", "사우디아라비아", "솔로몬 제도", "세이셸", "수단", "스웨덴", "싱가포르", "세인트 헬레나", "슬로베니아", "스발바르 & 얀 마옌", "슬로바키아", "시에라리온", "산 마리노", "세네갈", "소말리아", "수리남", "남수단", "상투메프린시페", "엘살바도르", "신트마르턴", "시리아", "에스와티니", "터크스 케이커스 제도", "차드", "프랑스 남방 지역", "토고", "태국", "타지키스탄", "토켈라우", "동티모르", "투르크메니스탄", "튀니지", "통가", "튀르키예", "트리니다드토바고", "투발루", "대만", "탄자니아", "우크라이나", "우간다", "미국 군소 제도", "미국", "캘리포니아", "우루과이", "우즈베키스탄", "바티칸 시국", "세인트빈센트 그레나딘", "베네수엘라", "영국령 버진 아일랜드", "미국령 버진 아일랜드", "베트남", "바누아투", "월리스 & 푸투나", "사모아", "코소보", "예멘", "마요트", "남아프리카공화국", "잠비아", "짐바브웨"]
    
    let countryCode = ["AD", "AE", "AF", "AG", "AI", "AL", "AM", "AO", "AR", "AS", "AT", "AU", "AW", "AX", "AZ", "BA", "BB", "BD", "BE", "BF", "BG", "BH", "BI", "BJ", "BL", "BM", "BN", "BO", "BR", "BS", "BT", "BV", "BW", "BY", "BZ", "CA", "CC", "CD", "CF", "CG", "CH", "CI", "CK", "CL", "CM", "CN", "CO", "CR", "CU", "CV", "CW", "CX", "CY", "CZ", "DE", "DJ", "DK", "DM", "DO", "DZ", "EC", "EE", "EG", "ER", "ES", "ET", "EU", "FI", "FJ", "FK", "FM", "FO", "FR", "GA", "GB", "GB-ENG", "GB-NIR", "GB-SCT", "GB-WLS", "GB-ZET", "GD", "GE", "GF", "GG", "GH", "GI", "GL", "GM", "GN", "GP", "GQ", "GR", "GS", "GT", "GU", "GW", "GY", "HK", "HM", "HN", "HR", "HT", "HU", "ID", "IE", "IL", "IM", "IN", "IO", "IQ", "IR", "IS", "IT", "JE", "JM", "JO", "JP", "KE", "KG", "KH", "KI", "KM", "KN", "KP", "KR", "KW", "KY", "KZ", "LA", "LB", "LC", "LGBT", "LI", "LK", "LR", "LS", "LT", "LU", "LV", "LY", "MA", "MC", "MD", "ME", "MF", "MG", "MH", "MK", "ML", "MM", "MN", "MO", "MP", "MQ", "MR", "MS", "MT", "MU", "MV", "MW", "MX", "MY", "MZ", "NA", "NC", "NE", "NF", "NG", "NI", "NL", "NO", "NP", "NR", "NU", "NZ", "OM", "PA", "PE", "PF", "PG", "PH", "PK", "PL", "PM", "PN", "PR", "PS", "PT", "PW", "PY", "QA", "RE", "RO", "RS", "RU", "RW", "SA", "SB", "SC", "SD", "SE", "SG", "SH", "SI", "SJ", "SK", "SL", "SM", "SN", "SO", "SR", "SS", "ST", "SV", "SX", "SY", "SZ", "TC", "TD", "TF", "TG", "TH", "TJ", "TK", "TL", "TM", "TN", "TO", "TR", "TT", "TV", "TW", "TZ", "UA", "UG", "UM", "US", "US-CA", "UY", "UZ", "VA", "VC", "VE", "VG", "VI", "VN", "VU", "WF", "WS", "XK", "YE", "YT", "ZA", "ZM", "ZW"]
}

